zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_rtc.h
/*****************************************************************************

  Copyright (C) 2025 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

/**
 * @file hw_rtc.h
 * @brief RTC (实时时钟) 硬件寄存器定义
 *
 * 本文件定义了 MSPM0G3507 微控制器中 RTC 模块的全部寄存器和位域。
 * RTC 提供实时时钟和日历功能，主要特性包括：
 * - 日历模式：年/月/日/时/分/秒（BCD/二进制格式）
 * - 闹钟功能：双闹钟（Alarm 1/Alarm 2）
 * - 时间戳功能：记录事件发生时间
 * - 预分频器：3级预分频（RT0PS/RT1PS/RT2PS）
 * - 篡改检测：16路篡改I/O（TIO0~TIO15）
 * - 时钟校准：偏移校准和温度补偿
 */

#ifndef ti_devices_msp_peripherals_hw_rtc__include
#define ti_devices_msp_peripherals_hw_rtc__include

/* Filename: hw_rtc.h */
/* Revised: 2025-08-07 23:42:45 */
/* Revision: dc9e142443540e975c7bab8070bd55003479c74b */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* RTC Registers - RTC 寄存器定义
******************************************************************************/

/* 各寄存器组基地址偏移 */
#define RTC_GEN_EVENT_OFS                        ((uint32_t)0x00001050U)  /* 通用事件寄存器偏移 */
#define RTC_CPU_INT_OFS                          ((uint32_t)0x00001020U)  /* CPU中断寄存器偏移 */
#define RTC_GPRCM_OFS                            ((uint32_t)0x00000800U)  /* GPRCM寄存器偏移 */


/** @addtogroup RTC_GEN_EVENT
  @{
*/

/* 通用事件中断寄存器组 */
typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001050) 中断索引寄存器 */
  __IO uint32_t IMASK;                             /* !< (@ 0x00001054) 中断屏蔽寄存器 */
  __I  uint32_t RIS;                               /* !< (@ 0x00001058) 原始中断状态 */
  __I  uint32_t MIS;                               /* !< (@ 0x0000105C) 屏蔽后中断状态 */
  __O  uint32_t ISET;                              /* !< (@ 0x00001060) 中断置位寄存器 */
  __O  uint32_t ICLR;                              /* !< (@ 0x00001064) 中断清除寄存器 */
} RTC_GEN_EVENT_Regs;

/*@}*/ /* end of group RTC_GEN_EVENT */

/** @addtogroup RTC_CPU_INT
  @{
*/

/* CPU 中断控制寄存器组 */
typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001020) 中断索引寄存器 */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001028) 中断屏蔽寄存器 */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001030) 原始中断状态 */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001038) 屏蔽后中断状态 */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001040) 中断置位寄存器 */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001048) 中断清除寄存器 */
} RTC_CPU_INT_Regs;

/*@}*/ /* end of group RTC_CPU_INT */

/** @addtogroup RTC_GPRCM
  @{
*/

/* GPRCM (通用电源/复位/时钟控制模块) 寄存器组 */
typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00000800) 电源使能寄存器 */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00000804) 复位控制寄存器 */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x00000808) 外设时钟配置寄存器 */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x00000814) 状态寄存器 */
} RTC_GPRCM_Regs;

/*@}*/ /* end of group RTC_GPRCM */

/** @addtogroup RTC
  @{
*/

/* RTC 主寄存器组 - 实时时钟/日历功能 */
typedef struct {
       uint32_t RESERVED0[273];
  __IO uint32_t FPUB_0;                            /* !< (@ 0x00000444) Publisher Port 0 */
       uint32_t RESERVED1[238];
  RTC_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00000800) */
       uint32_t RESERVED2[507];
  __I  uint32_t CLKSEL;                            /* !< (@ 0x00001004) Clock Select for Ultra Low Power peripherals */
       uint32_t RESERVED3[6];
  RTC_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00001020) */
       uint32_t RESERVED4;
  RTC_GEN_EVENT_Regs  GEN_EVENT;                         /* !< (@ 0x00001050) */
       uint32_t RESERVED5[30];
  __IO uint32_t EVT_MODE;                          /* !< (@ 0x000010E0) Event Mode */
       uint32_t RESERVED6[6];
  __I  uint32_t DESC;                              /* !< (@ 0x000010FC) RTC Descriptor Register */
  __IO uint32_t CLKCTL;                            /* !< (@ 0x00001100) RTC Clock Control Register */
  __IO uint32_t DBGCTL;                            /* !< (@ 0x00001104) RTC Module Debug Control Register */
  __IO uint32_t CTL;                               /* !< (@ 0x00001108) RTC Control Register */
  __I  uint32_t STA;                               /* !< (@ 0x0000110C) RTC Status Register */
  __IO uint32_t CAL;                               /* !< (@ 0x00001110) RTC Clock Offset Calibration Register */
  __IO uint32_t TCMP;                              /* !< (@ 0x00001114) RTC Temperature Compensation Register */
  __IO uint32_t SEC;                               /* !< (@ 0x00001118) RTC Seconds Register - Calendar Mode With Binary /
                                                      BCD Format */
  __IO uint32_t MIN;                               /* !< (@ 0x0000111C) RTC Minutes Register - Calendar Mode With Binary /
                                                      BCD Format */
  __IO uint32_t HOUR;                              /* !< (@ 0x00001120) RTC Hours Register - Calendar Mode With Binary /
                                                      BCD Format */
  __IO uint32_t DAY;                               /* !< (@ 0x00001124) RTC Day Of Week / Month Register - Calendar Mode
                                                      With Binary / BCD Format */
  __IO uint32_t MON;                               /* !< (@ 0x00001128) RTC Month Register - Calendar Mode With Binary /
                                                      BCD Format */
  __IO uint32_t YEAR;                              /* !< (@ 0x0000112C) RTC Year Register - Calendar Mode With Binary /
                                                      BCD Format */
  __IO uint32_t A1MIN;                             /* !< (@ 0x00001130) RTC Minute Alarm Register - Calendar Mode With
                                                      Binary / BCD Format */
  __IO uint32_t A1HOUR;                            /* !< (@ 0x00001134) RTC Hours Alarm Register - Calendar Mode With
                                                      Binary / BCD Format */
  __IO uint32_t A1DAY;                             /* !< (@ 0x00001138) RTC Alarm Day Of Week / Month Register - Calendar
                                                      Mode With Binary / BCD Format */
  __IO uint32_t A2MIN;                             /* !< (@ 0x0000113C) RTC Minute Alarm Register - Calendar Mode With
                                                      Binary / BCD Format */
  __IO uint32_t A2HOUR;                            /* !< (@ 0x00001140) RTC Hours Alarm Register - Calendar Mode With
                                                      Binary / BCD Format */
  __IO uint32_t A2DAY;                             /* !< (@ 0x00001144) RTC Alarm Day Of Week / Month Register - Calendar
                                                      Mode With Binary / BCD Format */
  __IO uint32_t PSCTL;                             /* !< (@ 0x00001148) RTC Prescale Timer 0/1 Control Register */
  __IO uint32_t EXTPSCTL;                          /* !< (@ 0x0000114C) RTC Prescale Timer 2 Control Register */
  __I  uint32_t TSSEC;                             /* !< (@ 0x00001150) Time Stamp Seconds Register - Calendar Mode With
                                                      Binary / BCD Format */
  __I  uint32_t TSMIN;                             /* !< (@ 0x00001154) Time Stamp Minutes Register - Calendar Mode With
                                                      Binary / BCD Format */
  __I  uint32_t TSHOUR;                            /* !< (@ 0x00001158) Time Stamp Hours Register - Calendar Mode With
                                                      Binary / BCD Format */
  __I  uint32_t TSDAY;                             /* !< (@ 0x0000115C) Time Stamp Day Of Week / MonthRegister - Calendar
                                                      Mode With Binary / BCD Format */
  __I  uint32_t TSMON;                             /* !< (@ 0x00001160) Time Stamp Month Register - Calendar Mode With
                                                      Binary / BCD Format */
  __I  uint32_t TSYEAR;                            /* !< (@ 0x00001164) Time Stamp Years Register - Calendar Mode With
                                                      Binary / BCD Format */
  __I  uint32_t TSSTAT;                            /* !< (@ 0x00001168) Time Stamp Status Register */
  __IO uint32_t TSCTL;                             /* !< (@ 0x0000116C) Time Stamp Control Register */
  __O  uint32_t TSCLR;                             /* !< (@ 0x00001170) Time Stamp Clear Register */
       uint32_t RESERVED7[31];
  __IO uint32_t LFSSRST;                           /* !< (@ 0x000011F0) Low frequency sub-system reset request */
       uint32_t RESERVED8[2];
  __IO uint32_t RTCLOCK;                           /* !< (@ 0x000011FC) Real time clock lock register */
} RTC_Regs;

